http://code.mu/tasks/php/base/rabota-s-ciklami-foreach-for-while-v-php.html

________________________________________________________________________________
Работа с foreach
Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью
цикла foreach выведите эти слова в столбик.
________________________________________________________________________________
<?php
$arr = ['html', 'css', 'php', 'js', 'jq'];
foreach ($arr as $value) {
  echo $value."\n";
}
 ?>
________________________________________________________________________________
Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму
элементов этого массива. Запишите ее в переменную $result.
________________________________________________________________________________
<?php
$sum = 0;
$arr = [1, 2, 3, 4, 5];
foreach ($arr as $value) {
  $res = $sum += $value;
  echo $res . "\n";
}
?>
________________________________________________________________________________
 Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму
 квадратов элементов этого массива. Результат запишите переменную $result.
________________________________________________________________________________
<?php
$sum = 0;
$arr = [1, 2, 3, 4, 5];
foreach ($arr as $value) {
  //$res = pow($value, 2);
  $res = $value *= $value;
  $res = $sum +=$value;
  echo $res."\n";
}
?>
________________________________________________________________________________
Работа с ключами
 Дан массив $arr. С помощью цикла foreach выведите на экран столбец ключей и
 элементов в формате 'green - зеленый'.
 $arr = ['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'];
________________________________________________________________________________
<?php
$arr = ['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'];
foreach ($arr as $key => $value) {
  echo $key. ' ' . $value."\n";
}
 ?>
________________________________________________________________________________
Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' и с элементами '200', '300', '400'.
С помощью цикла foreach выведите на экран столбец строк такого формата: 'Коля -
зарплата 200 долларов.'.
________________________________________________________________________________
<?php
$arr = ['Коля'=> 200, 'Вася'=> 300, 'Петя' => 400 ];
foreach ($arr as $key => $value) {
  echo "$key - зарабатывет $value долларов. \n";
}
 ?>
________________________________________________________________________________
Циклы while и for
Решите эти задачи сначала через цикл while, а затем через цикл for.
 Выведите столбец чисел от 1 до 100.
________________________________________________________________________________
<?php
$i = 0;
while ($i <= 99){
  echo $i++."\n";
}

for ( $i = 1; $i <= 100; $i++){
  echo $i."\n";
}
 ?>
________________________________________________________________________________
Выведите столбец чисел от 11 до 33.
________________________________________________________________________________
<?php
$i= 11;
while ($i <= 33) {
  echo $i++."\n";
}
 ?>
<?php
for ($i = 11; $i <= 33; $i++){
  echo $i."\n";
}
?>
________________________________________________________________________________
 Выведите столбец четных чисел в промежутке от 0 до 100
________________________________________________________________________________
<?php
$i = 0;
while ($i <= 99){
  echo $i+=2;
  echo "\n";
}
?>
<?php
for ($i =0; $i <= 100; $i+=2){
  echo $i."\n";
}
?>
________________________________________________________________________________
С помощью цикла найдите сумму чисел от 1 до 100
________________________________________________________________________________
<?php
$sum = 0;
$i = 0;
while ($i <= 99){
  $i++;
  $res = $sum +=$i;

}
echo $res."\n";
 ?>
 <?php
 $sum = 0;
for ($i = 1; $i <= 100; $i++){
  $res = $sum +=$i;
}
echo $res;
 ?>
________________________________________________________________________________
Задачи
 Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора
 if выведите на экран столбец тех элементов массива, которые больше 3-х,
 но меньше 10.
________________________________________________________________________________
<?php
$arr = [2, 5, 9, 15, 0, 4];
foreach ($arr as $value) {
  if ($value > 3 && $value < 10 ) {
    echo $value."\n";
  }
}
?>
________________________________________________________________________________
Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите
сумму положительных элементов этого массива.
________________________________________________________________________________
<?php
$sum = 0;
$arr = [2, 5, 9, 0, 4, -2 , -1, -3, -5];
foreach ($arr as $value) {
  if ($value > 0) {
    $res = $sum += $value;
  }
}echo $res;
?>
________________________________________________________________________________
Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла foreach и
оператора if проверьте есть ли в массиве элемент со значением, равным 4.
Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего
делать не надо.
________________________________________________________________________________
<?php
$arr = [1, 2, 5, 9, 4, 13, 4, 10];
foreach ($arr as $value) {
  if ($value == 4){
    echo "ect";
    break;
  }
}
?>
________________________________________________________________________________
 Дан массив числами, например: ['10', '20', '30', '50', '235', '3000']. Выведите
на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.
________________________________________________________________________________
<?php
$arr = ['10', '20', '30', '50', '235', '3000'];
foreach ($arr as $value) {
  if ($value[0] == 1 || $value[0] == 2 || $value[0] == 5 ) {
    echo $value."\n";
  }
}
?>
________________________________________________________________________________
Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach
создайте строку '-1-2-3-4-5-6-7-8-9-'.
________________________________________________________________________________
<?php
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
foreach ($arr as $value) {
  if ($value < 10 ){
    echo '-'.$value;
  }
} echo '-';
?>
________________________________________________________________________________
Составьте массив дней недели. С помощью цикла foreach выведите все дни недели,
а выходные дни выведите жирным.
________________________________________________________________________________
<?php
$arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
foreach ($arr as $value) {
  if ($value != 'сб' || $value != 'вс'){
    echo $value;
  }
  else{
    echo '<b>'.$value.'</b>';
  }
}
?>
________________________________________________________________________________
Составьте массив дней недели. С помощью цикла foreach выведите все дни недели,
а текущий день выведите курсивом. Текущий день должен храниться в переменной $day.
________________________________________________________________________________
<?php
$day = date('w');
$arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
foreach ($arr as $value) {
  if($value != $day){
    echo $value;
    if ($value == $day) {
      echo '<i>'.$value.'</i><br>';
    }
  }
}
?>
________________________________________________________________________________
Задачи посложнее
 С помощью цикла for заполните массив числами от 1 до 100. То есть у вас должен
 получится массив [1, 2, 3... 100].
________________________________________________________________________________
<?php
$arr = [];
for ($i = 1; $i <= 100; $i++){
  $arr[] = $i ;
}
var_dump($arr);
?>
________________________________________________________________________________
Дан массив $arr. С помощью цикла foreach запишите английские названия в массив
$en, а русские - в массив $ru.
$arr = ['green'=>'зеленый', 'red'=>'красный', 'blue'=>'голубой'];
________________________________________________________________________________
<?php
$en = [];
$ru = [];
$arr = ['green'=>'зеленый', 'red'=>'красный', 'blue'=>'голубой'];
foreach ($arr as $e => $r) {
  //echo $en.' '.$ru."\n";
  $en[] = $e;
  $ru[] = $r;
}var_dump($en);
print_r($ru);
?>
________________________________________________________________________________
Дано число $num=1000. Делите его на 2 столько раз, пока результат деления не
станет меньше 50. Какое число получится? Посчитайте количество итераций,
необходимых для этого (итерация - это проход цикла). Решите задачу сначала
через цикл while, а потом через цикл for.
________________________________________________________________________________
<?php
$num = 1000;
$i = 0;
while ($num >= 50) {
	$num /= 2;
	$i++;
}
	echo $num . "\n";
	echo $i . "\n";
	echo "\n";
?>
<?php
for ($num = 1000, $i=0; $num >= 50 ; $i++) {
  $num /= 2;
} echo $num."\n";
echo $i."\n";
?>
