________________________________________________________________________________
Работа с count
Для решения задач данного блока вам понадобятся следующие функции: count.
Дан массив $arr. Подсчитайте количество элементов этого массива.
________________________________________________________________________________
<?php
$arr = ['a', 'b', 'c', 'd', 'e'];
print count($arr);
?>
________________________________________________________________________________
Дан массив $arr. С помощью функции count выведите последний элемент данного массива.
________________________________________________________________________________
Работа с in_array
Для решения задач данного блока вам понадобятся следующие функции: in_array.
 Дан массив с числами. Проверьте, что в нем есть элемент со значением 3.
________________________________________________________________________________
<?php
$arr = [1, 2, 3, 4, 5];
var_dump(in_array(3, $arr));
?>
________________________________________________________________________________
